7/20 월요일
1. 에이작스 페이징처리하기
	ㄴ  server에서 링크는 감 But ajax로 만든 링크는 이동 x    		해결oooo
	
	href='/beepPro/QnA/choicelist.ajax?page=5&m_sub_seq=0'
	자바스크립트 접근 안되는                     듯
	href='/beepPro/QnA/choicelist.ajax?page=2&m_sub_seq=0'

2. 회원가입 만들기  										해결oooo
3.${authUser.name}로로그인 사용 
로그인 서버에서 아이디틀림 비밀번호 틀림 알려줄 수 있게 수정 				해결oooo

4. 약관동의페이지 약관 미동의시 알림 							해결oooo

5. 회원가입 memberdto까지 만듬   							해결oooo

6. 회원가입 사용가능 뜬 후 다시 중복체크 시 사라지지않음   				해결oooo
   ㄴ  중복체크시 ok나오면 아이디칸 disabled 아이디 수정하기 누르면 다른거 다시 disable?

7. 회원가입정보입력란에서 앞 핸드폰번호체크 파라미터 가능할까 아님 유효성검사라도
8. 회원가입 시 파일올리는거,, mrequest,,,   					해결oooo
9. 마이페이지 헤더  										 해결oooo


7/21 화요일
1. async: false 속성 공부하기
2. 재웅이 모달창 공부
	ㄴ 해결
3. ajax 페이징처리 2ajax 오류뭔지 확인 



7/24 금요일 ~
1. 회원 가입시 닉네임 중복 체크

2. 의사 회원가입 파일 2개 받는 경우 체크
	ㄴ 의사 면허번호 검증
	ㄴ 의사 병원 선택?

3. qna 글 수정 삭제  <ok>

4. qna 게시글 좋아요  <ok>
	
5. qna 대댓글 달기   <ok>

6. qna 게시글 신고하기 <ok>

7. qna 댓글  신고하기 <ok>
    ㄴ 댓글 수정 삭제

8. qna 댓글 페이징 처리

9. qna 정렬하기 ajax

10. qna 검색하기(searchWord)

11. 메인 페이지 리스트 가져오기

12. 댓글 좋아요 db 추가 기능 구현 <ok>
	ㄴ 두번 좋아요 할 수 x

13. 메인페이지 자동완성기능 <nk>

14. 재웅이 가격정보, 꿀팁정보 페이징처리랑 서치워드


07/30 금요일
1. 재웅이 탑팁보드 searchWord 오류잡고 ajax처리

2. 민정 qna 댓글 페이징

3. 민정 qna 정렬  <ok>

4. 수현언니 회원가입 파일올리기, 더보기

5. 메인 두번째 검색 페이지

6. 디비 수정하기 lieks없애기 clob 잘되는지 확인

7. 로그인창에서 회원가입으로 안가짐

